import random
import json

main_loop_phase = 'begin'
world_structure = None

StateSet = [x+"州" for x in ["豫","青","徐","扬","荆","梁","雍","冀","兖"]]
WorldSet = ["凡间","灵界","仙界"]
MainlandSet = [x+"大陆" for x in ["金","木","水","火","土"]]
CountrySet = ["齐国","楚国","燕国","韩国","赵国","魏国","秦国","后梁","后唐","后晋","后汉","后周","奢比尸国","结匈国","羽民国","讙头国","厌火国","三苗国","载国","贯匈国","交胫国","不死民国","歧舌国","三首国","周饶国","长臂国","三身国","奇肱国","青丘国","黑齿国","纪国","前蜀","后蜀","吴","南唐","吴越","闽","楚","南汉","南平","北汉","鲁","吴","越","宋","郑","鄫","邾（邹）","莒","吕","许","虢","虞","州","淳于","杞","莱","萧","徐","舒","纪","谭","管","蔡","郧","蒋","芮","沈","曹","霍","庸","权","谢","巴","息","郤","邢","祝","鄣","聂","陈","薛","巩","叶","项","卫","滕","江","葛","戴","宿","遂","钟吾","炎","鄅","毕","申","罗","邓","绞","唐","刘","黄","厉（随）","蓼","鄀","肥","鼓","中山","鄟","祝其","姒","蓐","耿","苏","冀","诸","共","井","缙","杨","邘","皖","邿","须句","郜","弦","郕","梁","向","凡","谷","赖","牟","柏","颛臾","焦","茅","滑","巢","雍","顿","黎","费","郇","胙","夔","郐","应","介","鄾","任","邳","胡","代","彭","苴","鱼","鱿","轸","扈","荀","桐","极","贾","祭","毛","根牟","甲父","绚","翨阳","有穷","道","微","柳","丰","六","瑕","姜","观","大庭","骀","岐","箕","莘","逼","倪","羽民国","灌头国","厌火国","载国","结胸国","歧舌国","周饶国","一臂国","言灵国","奇肱国","丈夫国","巫咸国","女子国","轩辕国","白民国","肃慎国","长股国","无启国","一目国","柔利国","深目国","聂耳国","无肠国","夸父国","博父国","拘缨国","歧踵国","大人国","君子国","雨师妾国","玄股国","毛民国","劳民国","伯虑国","里耳国","雕题国","北雊国","枭阳国","巴国","氐人国","匈奴国","开题国","列人国","流黄封氐国","东胡国","夷人国","貊国","燕国","犬封国","蟜国","阘非国","环狗国","魅国","戎国","林氐国","盖国","巨燕国","倭国","朝鲜国","列阳国","姑射国","大蟹国","陵鱼国","鯾鱼国","墩端国","玺唤国","大夏国","竖沙国","居繇国","月支国","韩雁国","始鸠国","大越国","彭泽国","聂阳国","少昊之国","靖人国","蒍国","中容国","司幽国","嬴土国","夏州国","盖余国","困民国","有易国","摇民国","熏民国","女和月母国","季禺国","卵民国","盈民国","季厘国","载民国","蜮民国","焦饶国","伯服国","鼬姓国","昆吾部落","张宏国","菌人国","淑士国","白氏国","长胫国","西周国","先民国","北狄国","沃民国","寒荒国","寿麻国","盖山国","互人国","胡不与国","叔歜国","北齐国","始州国","詹耳国","犬戎国","继无民国","中煸国","赖丘国","苗民国","牛黎国","天毒国","壑市国","汜叶国","朝云国","司彘国","禺中国","列襄国","盐长国","流黄辛氏国","朱卷国","氏羌国","大幽国","钉灵国","夏商","西周","东周","汉","魏","蜀","吴","晋","宋","齐","梁","陈","北魏","东魏","西魏","北齐","北周","隋","唐","契丹","匈奴","大月氏","宋","金","辽","元","明","清","汉赵","成汉","前凉","后赵","前燕","前秦","后燕","后秦","西秦","后凉","南凉","北凉","南燕","西凉","北燕","夏","代国","冉魏","西燕","西蜀","翟魏","吐谷浑"]

class CountryStructure:
    def __init__(self):
        self.states = random.sample(StateSet, random.randint(1, len(StateSet)))

    def __str__(self):
        sub = [s for s in self.states]
        return "\t".join(sub)

class MainlandStructure:
    def __init__(self):
        contries = random.sample(CountrySet, random.randint(1, len(CountrySet)))
        self.contries = {x : CountryStructure() for x in contries}

    def __str__(self):
        sub = [k + "\t\t\t" + str(v) for k, v in self.contries.items()]
        return "\n\t\t".join(sub)

class WorldStructure:
    def __init__(self):
        mainlands = random.sample(MainlandSet, random.randint(1, len(MainlandSet)))
        self.mainlands = {x: MainlandStructure() for x in mainlands}

    def __str__(self):
        sub = [k + "\t\t" + str(v) for k, v in self.mainlands.items()]
        return "\n\t".join(sub)


class Actor:
    def __init__(self):
        self.age = 0
        self.gender = "male"
        self.height = 180